name: "vae_decoder"
backend: "onnxruntime"
max_batch_size: 0

input [
  {
    name: "latent_sample"
    data_type: TYPE_FP32
    dims: [-1, 4, -1, -1]  # Dynamic batch size
  }
]
output [
  {
    name: "sample"
    data_type: TYPE_FP32
    dims: [-1, 3, -1, -1]  # Dynamic batch size
  }
]
instance_group [
  {
    kind: KIND_CPU
  }
]

optimization { execution_accelerators {
  cpu_execution_accelerator : [ {
    name : "openvino"
  }]
}}