{
  "_name_or_path": "/root/.cache/huggingface/hub/models--neta-art--neta-xl-2.0/snapshots/3b5b71e53e392a96238e72f95d88ec17990e8ca6/text_encoder_2",
  "architectures": [
    "CLIPTextModelWithProjection"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "dropout": 0.0,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_size": 1280,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "intermediate_size": 5120,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 77,
  "model_type": "clip_text_model",
  "num_attention_heads": 20,
  "num_hidden_layers": 32,
  "output_hidden_states": true,
  "pad_token_id": 1,
  "projection_dim": 1280,
  "torch_dtype": "float16",
  "transformers_version": "4.45.2",
  "vocab_size": 49408
}
